$(function(){
	var scale2img = {}
	jp2kr = {


        "あ":"아","い":"이","う":"우","え":"에","お":"오",
        "か":"카","き":"키","く":"쿠","け":"케","こ":"코",
        "さ":"사","し":"시","す":"수","せ":"세","そ":"소",
        "た":"타","ち":"치","つ":"츠","て":"테","と":"토",
        "な":"나","に":"니","ぬ":"누","ね":"네","の":"노",
        "は":"하","ひ":"히","ふ":"후","へ":"헤","ほ":"호",
        "ま":"마","み":"미","む":"무","め":"메","も":"모",
        "や":"야","ゆ":"유","よ":"요",
        "ら":"라","り":"리","る":"루","れ":"레","ろ":"로",
        "わ":"와","を":"오",
        "が":"가","ぎ":"기","ぐ":"구","げ":"게","ご":"고",
        "ざ":"자","じ":"지","ず":"즈","ぜ":"제","ぞ":"조",
        "だ":"다","ぢ":"지","づ":"즈","で":"데","ど":"도",
        "ば":"바","び":"비","ぶ":"부","べ":"베","ぼ":"보",
        "ぱ":"파","ぴ":"피","ぷ":"푸","ぺ":"페","ぽ":"포",
        "きゃ":"갸","きゅ":"규","きょ":"겨",
        "ぎゃ":"갸","ぎゅ":"규","ぎょ":"교",
        "しゃ":"샤","しゅ":"슈","しょ":"쇼",
        "じゃ":"자","じゅ":"주","じょ":"조",
        "ちゃ":"자","ちゅ":"주","ちょ":"조",
        "ぢゃ":"자","ぢゅ":"주","ぢょ":"조",
        "にゃ":"냐","にゅ":"뉴","にょ":"녀",
        "ひゃ":"햐","ひゅ":"휴","ひょ":"효",
        "びゃ":"뱌","びゅ":"뷰","びょ":"뵤",
        "ぴゃ":"퍄","ぴゅ":"퓨","ぴょ":"표",
        "みゃ":"먀","みゅ":"뮤","みょ":"묘",
        "りゃ":"랴","りゅ":"류","りょ":"려",
        "あん":"안","いん":"인","うん":"운","えん":"엔","おん":"온",
        "かん":"간","きん":"긴","くん":"군","けん":"겐","こん":"건",
        "さん":"산","しん":"신","すん":"순","せん":"생","そん":"선",
        "たん":"단","ちん":"진","つん":"둔","てん":"","とん":"돈",
        "なん":"난","にん":"인","ぬん":"눈","ねん":"","のん":"",
        "はん":"반","ひん":"빈","ふん":"흔","へん":"행","ほん":"헌",　　
        "まん":"만","みん":"민","むん":"문","めん":"면","もん":"몽",
        "やん":"양","ゆん":"윤","よん":"연",
        "らん":"란","りん":"린","るん":"릉","れん":"련","ろん":"론",
        "わん":"완",
        "がん":"건","ぎん":"긴","ぐん":"군","げん":"겐","ごん":"공",
        "ざん":"잔","じん":"진","ずん":"쥰","ぜん":"젠","ぞん":"존",
        "だん":"댄","ぢん":"진","づん":"쥰","でん":"덴","どん":"돈",
        "ばん":"밴","びん":"빈","ぶん":"붕","べん":"벤","ぼん":"본",
        "ぱん":"빵","ぴん":"핀","ぷん":"분","ぺん":"펜","ぽん":"번",
        "きゃん":"걍","きゅん":"균","きょん":"경",
        "ぎゃん":"기안","ぎゅん":"균","ぎょん":"굔",
        "しゃん":"샨","しゅん":"슌","しょん":"션",
        "じゃん":"장","じゅん":"쥰","じょん":"전",
        "ちゃん":"잔","ちゅん":"준","ちょん":"촌",
        "ぢゃん":"장","ぢゅん":"쥰","ぢょん":"전",
        "びゃん":"뱐","びゅん":"변","びょん":"병",
        "ぴゃん":"뺜","ぴゅん":"쁀","ぴょん":"편",
        "にゃん":"냥","にゅん":"","にょん":"년",
        "ひゃん":"향","ひゅん":"흉","ひょん":"현",
        "みゃん":"먄","みゅん":"뮨","みょん":"면",
        "りゃん":"량","りゅん":"륜","りょん":"련",
        "っか":"까","っき":"끼","っく":"꾸","っけ":"께","っこ":"꼬",
        "っさ":"싸","っし":"씨","っす":"쓰","っせ":"쎄","っそ":"써",
        "っきゃ":"","っきょ":"꾜","っきゅ":"뀨",
        "った":"따","っち":"띠","っつ":"뚜","って":"떼","っと":"또",
        "にょん":"녕",


	}
	$('#sukeice').keyup(
		function(){
			var japanese = $(this).val();
			var result;
			var sukeice = '|╬ﾟ ﾟ|なにがチョンだよ。俺のことこれ以上韓国とか';
			result = japanese.replace(/(っ?.[ゃゅょ]?ん?)/ig,
				function(all,group){
					if(jp2kr[group]===undefined){
						return group;
					}
					return jp2kr[group];
				}
				);
			$('#result').text(sukeice+result);
		}
	);
    $('#sukeice').keyup(
        function(){
            var num = $('#result').text().length;
            $('#mojisu').text(num+'/60');
            if(num <= 60){
                $('#mojisu').css("color","#333");
            }else{
                $('#mojisu').css("color","#f33");
            }
        }
    );
});